[
  {
    "title": "Enterprise Cache Management Platform (IDP)",
    "slug": "enterprise-cache-management-platform",
    "description": "Architected and developed a unified Next.js/OpenShift portal to centralize cache management for Akamai (Edge) and Redis (Backend). Consolidated disparate cache tools into a single pane of glass, streamlining 100+ daily requests via a self-service model.",
    "githubUrl": "",
    "highlight": true
  },
  {
    "title": "SRE AI Assistant & Automation",
    "slug": "sre-ai-assistant-automation",
    "description": "Engineered a GenAI assistant using Ford’s native LLM and Akamai/ServiceNow APIs to automate incident triage and root cause analysis. Reduced Mean Time To Resolution (MTTR) for critical incidents by 30% through automated log analysis.",
    "githubUrl": "",
    "highlight": true
  },
  {
    "title": "Centralized SRE & Observability-as-Code",
    "slug": "centralized-sre-observability-as-code",
    "description": "Leading the technical transition to a Central SRE model, scaling support to 250+ applications without increasing headcount. Developed modular Terraform libraries and GitOps workflows (ArgoCD) to auto-provision Dashboards, SLOs, and Alerts, reducing project onboarding time from days to minutes.",
    "githubUrl": "",
    "highlight": true
  },
  {
    "title": "Cloud-Native CI/CD (Tekton)",
    "slug": "cloud-native-ci-cd-tekton",
    "description": "Architected and managed modern Tekton pipelines on OpenShift to automate the deployment of SRE-led initiatives, ensuring high availability and seamless rollouts.",
    "githubUrl": "",
    "highlight": false
  },
  {
    "title": "Proactive Health Monitoring",
    "slug": "proactive-health-monitoring",
    "description": "Built custom Python web crawlers to detect broken URLs and assets proactively, significantly reducing client-side errors and improving user experience.",
    "githubUrl": "",
    "highlight": false
  },
  {
    "title": "Unified Dashboarding",
    "slug": "unified-dashboarding",
    "description": "Developed a custom Next.js dashboard to provide development teams with a real-time, holistic view of application health and error budget consumption.",
    "githubUrl": "",
    "highlight": false
  },
  {
    "title": "Custom Ecommerce websites",
    "slug": "custom-ecommerce-websites",
    "description": "Developed custom Ecommerce websites for local businesses using Node JS, React, and MongoDB.",
    "githubUrl": "",
    "highlight": false
  },
  {
    "title": "Chat application",
    "slug": "chat-application",
    "description": "Developed a full-scale chat application using Firebase and Next JS.",
    "githubUrl": "",
    "highlight": false
  }
]
